--附加数据库
EXEC sp_attach_db @dbname = N'NCGL422023', 
   @filename1 = N'E:\喻骏文件夹\1_按项目划分的文件夹\2023年农村公路标准库文件\20240103-2023农村公路标准库-1\2005\NCGL422023.mdf'
    ,@filename2 = N'E:\喻骏文件夹\1_按项目划分的文件夹\2023年农村公路标准库文件\20240103-2023农村公路标准库-1\NCGL422023.ldf'

backup database [NCGL422023]
TO disk = 'D:\20231012_湖北2023年年报汇编文件夹\2023农村公路标准库\NCGL422023_20240102空库'

backup database [NCGL422023]
TO disk = 'D:\20231012_湖北2023年年报汇编文件夹\2023农村公路标准库\NCGL422023_20240103-1'

--分离数据库
EXEC sp_detach_db 'NCGL342023', 'true'


-----------------------------------------------------------------------------------------------
-----------------------------------------------------------------------------------------------
--标准库转2005版
EXEC sp_attach_db @dbname = N'NCGL422023', 
   @filename1 = N'E:\6078曹勇嵩\1.工作文件\2.安徽工作文件\1.工作文件（日期分类）\报部报规划司\2023年农村公路标准库_20240102\NCGLXX2023.mdf'
  --  ,@filename2 = N'E:\喻骏文件夹\1_按项目划分的文件夹\2023年农村公路标准库文件\20240103-2023农村公路标准库-1\NCGL422023.ldf'

--分离数据库
EXEC sp_detach_db 'NCGL422023', 'true'