/*if exists(select * from tempdb..sysobjects where id=object_id('tempdb..#tk060'))
drop table #tk060
SELECT 
[序号],[桥梁名称],[桥梁代码],[桥梁中心桩号],[路线编号],[跨径组合(孔*米）],[桥面净宽(米)],[主桥上部构造（结构类型）],[主桥上部构造代码],[主桥上部构造材料],[桥墩类型代码],[桥墩类型],[设计荷载等级代码],[设计荷载等级],[跨越地物代码],[跨越地物类型],[跨越地物名称],[建设单位],[设计单位],[施工单位],[监理单位],[建成通车日期],[管养单位名称],[监管单位名称],[收费性质],[评定等级],[评定日期],[评定单位],[改造年度],[完工日期],[改造部位],[工程性质],[改造施工单位],[是否部补助项目],[桥梁所在位置],[是否宽路窄桥],[是否在长大桥梁目录中],[备注],[桥梁身份码]
INTO TK060
from OPENROWSET ('Microsoft.JET.OLEDB.4.0', 'Excel 8.0;HDR=YES;DATABASE=E:\6078曹勇嵩\1.工作文件\2.安徽工作文件\1.工作文件（日期分类）\20240127 国省道桥梁对比\QL01280000.xls', sheet1$ ) 
*/



/*
truncate table tk060
insert into tk060(
[序号],[桥梁名称],[桥梁代码],[桥梁中心桩号],[路线编号],[跨径组合(孔*米）],[桥面净宽(米)],[主桥上部构造（结构类型）],[主桥上部构造代码],[主桥上部构造材料],[桥墩类型代码],[桥墩类型],[设计荷载等级代码],[设计荷载等级],[跨越地物代码],[跨越地物类型],[跨越地物名称],[建设单位],[设计单位],[施工单位],[监理单位],[建成通车日期],[管养单位名称],[监管单位名称],[收费性质],[评定等级],[评定日期],[评定单位],[改造年度],[完工日期],[改造部位],[工程性质],[改造施工单位],[是否部补助项目],[桥梁所在位置],[是否宽路窄桥],[是否在长大桥梁目录中],[备注],[桥梁身份码])
SELECT 
[序号],[桥梁名称],[桥梁代码],[桥梁中心桩号],[路线编号],[跨径组合(孔*米）],[桥面净宽(米)],[主桥上部构造（结构类型）],[主桥上部构造代码],[主桥上部构造材料],[桥墩类型代码],[桥墩类型],[设计荷载等级代码],[设计荷载等级],[跨越地物代码],[跨越地物类型],[跨越地物名称],[建设单位],[设计单位],[施工单位],[监理单位],[建成通车日期],[管养单位名称],[监管单位名称],[收费性质],[评定等级],[评定日期],[评定单位],[改造年度],[完工日期],[改造部位],[工程性质],[改造施工单位],[是否部补助项目],[桥梁所在位置],[是否宽路窄桥],[是否在长大桥梁目录中],[备注],[桥梁身份码]
from OPENROWSET ('Microsoft.JET.OLEDB.4.0', 'Excel 8.0;HDR=YES;DATABASE=E:\6078曹勇嵩\1.工作文件\2.安徽工作文件\1.工作文件（日期分类）\20240127 国省道桥梁对比\QL01280000.xls', sheet1$ ) 
*/


--SELECT * FROM TK060 
--SELECT COUNT(*) FROM ##TK060 WHERE RTRIM([桥梁身份码])is not null

---551  --桥梁编号使用了最后一位！
SELECT  left(k0101,4)+left(a0103,6)+'L'+rtrim(k6001)+RTRIM(K6002)+RTRIM(K6003),[桥梁代码]+[桥梁名称]+rtrim([桥梁中心桩号])
from k060 
right join  tk060 on rtrim(k6040)=tk060.[桥梁身份码]
where left(k0101,4)+left(a0103,6)+'L'+rtrim(k6001) is not null 
group by left(k0101,4)+left(a0103,6)+'L'+rtrim(k6001)+RTRIM(K6002)+RTRIM(K6003),[桥梁代码]+[桥梁名称]+rtrim([桥梁中心桩号])
having left(k0101,4)+left(a0103,6)+'L'+rtrim(k6001)+RTRIM(K6002)+RTRIM(K6003)<>[桥梁代码]+[桥梁名称]+rtrim([桥梁中心桩号])


---1004
SELECT  left(k0101,4)+left(a0103,6)+'L'+rtrim(k6001)+RTRIM(K6002)+RTRIM(K6003) qlbm,[桥梁代码]+[桥梁名称]+rtrim([桥梁中心桩号]) xlsqlbm
from k060 
right join  tk060 on left(k0101,4)+left(a0103,6)+'L'+rtrim(k6001)=tk060.[桥梁代码]
where left(k0101,4)+left(a0103,6)+'L'+rtrim(k6001) is not null  
and tk060.[桥梁身份码] is null
group by left(k0101,4)+left(a0103,6)+'L'+rtrim(k6001)+RTRIM(K6002)+RTRIM(K6003),[桥梁代码]+[桥梁名称]+rtrim([桥梁中心桩号])
having left(k0101,4)+left(a0103,6)+'L'+rtrim(k6001)+RTRIM(K6002)+RTRIM(K6003)<>[桥梁代码]+[桥梁名称]+rtrim([桥梁中心桩号])
