/*
---建成通车日期
神山口立交桥			G205340202L0170	1417.667	G205		否-
黄山东路立交桥		G205340202L0180	1418.872	G205		否-
袁泽桥（下行）		G205340209L0200	1419.912	G205		是 --
新塘桥						G205340209L0210	1421.97	G205			否-
大浦立交桥				G205340223L0260	1445.865	G205		否-
张公渡主线桥(上行）	G205340223L0290	1460.188	G205	否-
跨铁路桥					G329340210L0011	616.385	G329			否-
周桥							S208340210L0070	80.352	S208			否-
二电站桥					S208340223L0090	107.925	S208			否-
螺百桥						S212340207L0010	72.815	S212			否-
二中立交桥				S339340212L0090	50.97	S339				是 --
竹塔桥						S339340212L0100	51.374	S339			是 --
蜀山桥						S451340281L0030	16.233	S451			否-
中山中桥（下行）	S460340223L0090	37.681	S460			否-
杨桥							S463340223L0020	14.746	S463			否-
何湾桥						S463340223L0030	19.394	S463			否

*/

declare @qlbm varchar(255)
declare @A1319 varchar(255)
declare @HA1319 varchar(255)
set @qlbm='S463340223L0030'
set @A1319='2'
set @HA1319='否'

SELECT @qlbm qlbm,'' k6002,'' k6003,@A1319 A1319,@HA1319 HA1319
union
SELECT left(k0101,4)+left(a0103,6)+'L'+rtrim(k6001),rtrim(k6002),rtrim(k6003),A1319,hA1319
from k060 
where left(k0101,4)+left(a0103,6)+'L'+rtrim(k6001) =@qlbm


update k060 set A1319=@A1319,HA1319=@HA1319
from k060 
where left(k0101,4)+left(a0103,6)+'L'+rtrim(k6001) =@qlbm



SELECT @qlbm qlbm,'' k6002,'' k6003,@A1319 A1319,@HA1319 HA1319
union
SELECT left(k0101,4)+left(a0103,6)+'L'+rtrim(k6001),rtrim(k6002),rtrim(k6003),A1319,hA1319
from k060 
where left(k0101,4)+left(a0103,6)+'L'+rtrim(k6001) =@qlbm

